src/M1.5_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       20590;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          48;
        startFace       20720;
    }
    wedge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       20768;
    }
    top
    {
        type            patch;
        nFaces          80;
        startFace       20800;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10400;
        startFace       20880;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10400;
        startFace       31280;
    }
    outlet
    {
        type            patch;
        nFaces          130;
        startFace       41680;
    }
)

// ************************************************************************* //
